# SQLite

In [1]:
import sqlite3
conn = sqlite3.connect('example.db')

In [2]:
c = conn.cursor()

c.execute(
    '''CREATE TABLE demo_table (name VARCHAR(20), age INT)'''
)

c.execute(
    '''INSERT INTO demo_table VALUES ("ram", 20), ("shyam", 30);'''
)

conn.commit()
conn.close()

In [3]:
import sqlite3
conn = sqlite3.connect('example.db')
c = conn.cursor()

In [4]:
for row in c.execute('SELECT * FROM demo_table'):
    print(row)

('ram', 20)
('shyam', 30)

# Jupyter Extensions

```
# !pip install ipython-sql
```

In [5]:
%load_ext sql
%sql sqlite:///example.db

In [6]:
%%sql
SELECT * FROM demo_table

 * sqlite:///example.db
Done.

[('ram', 20), ('shyam', 30)]

In [7]:
%%sql
INSERT INTO demo_table VALUES 
    ('sarswati', 40), 
    ('padhma', 50); 
    
SELECT * FROM demo_table

 * sqlite:///example.db
2 rows affected.
Done.

[('ram', 20), ('shyam', 30), ('sarswati', 40), ('padhma', 50)]

# Pandas to Database

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame({
    'Name': ['Ram', 'Shyam', 'Gobinda'], 
    'Age': [10, 20, 30], 
    'Wife': ['Sita', 'Radha', 'Devi']
})
df

      Name  Age   Wife
0      Ram   10   Sita
1    Shyam   20  Radha
2  Gobinda   30   Devi

In [10]:
df.to_sql('gods', conn)

3

In [11]:
%%sql
SELECT * FROM gods;

 * sqlite:///example.db
Done.

[(0, 'Ram', 10, 'Sita'), (1, 'Shyam', 20, 'Radha'), (2, 'Gobinda', 30, 'Devi')]